app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes" WHERE "clientes"."cpf" = '1'
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = 0 LIMIT 1
---
  def show
    id = params[:id]
    cpf_consulta = id[id.length-1..id.length]
    consulta = Cliente.where(:cpf => cpf_consulta)
    if consulta.present?
      @cliente = consulta[0]
    else
      consulta = Cliente.where(:cpf => params[:id])
      if consulta.present?
        @cliente = consulta[0]
      else
        @cliente = Cliente.find(params[:id])

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = 1 LIMIT 1
---
  def edit
    @cliente = Cliente.find(params[:id])

INSERT INTO "clientes" ("nome", "cep", "email", "telefone", "updated_at", "data_nascimento", "ddd", "created_at", "cpf", "complemento") VALUES ('Alex', '123123', 'abgrilo@gmail.com', '12u23', '2011-05-26 17:20:59.737526', '2011-05-26', '11', '2011-05-26 17:20:59.737526', '11111111', '1')
---
  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save